{
    "experience": [
        {
            "name": "BSD Enterprise",
            "type": "Technological Consultancy",
            "dateFrom": "Aug. 2017",
            "dateTo": "Present Day",
            "position": "Front-End Developer / Technical Leader",
            "description": "AngularJS and Angular project development for banking area.\nDeveloping solutions for the migration and new developments of the web portal of one of the most important banks in Spain.",
            "featured": [
                {
                    "name": "Banco Santander NuevaWebEmpresas:",
                    "description": "Development the web portal as well as migration from AngularJS (1.5) to Angular 5, changing its functionality, ‘look & feel’, full responsive mobile first design.\n My role as one of the team leaders involved:\n- Informing Project Manager about the status.\n- Coordinating Scrum dailies and work.\n- Distributing work around the rest of the team members\n- Mentoring other team members\n- Developing the core parts of our sprint tasks."
                },
                {
                    "name": "Banco Santander SAM:",
                    "description": "Development of bank functionality in AngularJS (1.5) to integrate in their web portal. My duty was to develop the styles architecture to avoid the upper iFrame overriding our styles."
                }
            ]
        },
        {
            "name": "Crazyvity",
            "type": "Digital Production Agency",
            "dateFrom": "Aug. 2017",
            "dateTo": "Oct. 2013",
            "position": "Front-End Developer / Technical Leader",
            "description": "Development of apps, websites, landing pages and advergaming, as well as management of the assigned team. Technical analysis and assessment of the projects according to the clients needs.",
            "featured": [
                {
                    "name": "Rich Media Animation Library (Crazyvity):",
                    "description": "The designers asked for an easier way to make rich media ads campaigns without programming. Besides rich media platforms as DoubleClick and Sizmek have a 100Kbs. limitation per ad, so I made a Vanilla JS library; that anyone can easily use to make animated interactive ads, automatizing their work even if they didn’t know anything about coding."
                },
                {
                    "name": "Fan del Mes (Travel Club):",
                    "description": "Our client Travel Club asked for a way to measure their Facebook user interactions. I developed a Javascript app using Vanilla JS and jQuery for their Facebook profile using its API. A cron job made in PHP to retrieve the feeds of all the users that interacted with the app using the Facebook API. I also create an admin panel for the client to easily use the application."
                }
            ]
        },
        {
            "name": "Monkey-Toons",
            "type": "Digital Production Studio",
            "dateFrom": "Sept. 2008",
            "dateTo": "Aug. 2013",
            "position": "Front-End Developer / Technical Leader",
            "description": "Development of apps, websites, landing pages and advergaming. Technical assessment of the projects according to the clients needs.",
            "featured": [
                {
                    "name": "Custom Christmas Platform (Christmas Interactivos):",
                    "description": "We created a web platform in Javascript for users can customized our xmas templates and sending them to their clients."
                }
            ]
        }
    ]  
}
